** 2017/05/23
takaxp [20:05]
変数に値を入れる setq と custom-set-variables の実行コストを比較した方って居ます？（どちらを使うべきという議論はちょっと置いておいて純粋に処理コストの比較にて）

pogin503 [08:37]
イメージとしてはsetqの方がコスト低そう(今手元に環境がないので)

tarao [08:51]
｀custom-set-variables｀ が実際に変数に値を入れるところはけっきょく ｀set｀ になっていてそれなりに速そうですが、それ以外にも一時変数に ｀setq｀ したりとかでけっきょく ｀setq｀ 自体も呼んでしまっていて、単発の ｀setq｀ には勝てない、という感じがしますがどうでしょうか (｀setq｀ 自体を呼んでる以外にもいろいろ ｀put｀ するのでその分のオーバーヘッドもあります)

syohex [14:40]
｀｀｀(defvar var1 nil)
(benchmark-run-compiled 10000 (setq var1 t))
(defvar var2 nil)
(benchmark-run-compiled 10000 (custom-set-variables
                '(var2 t)))｀｀｀

｀custom-set-variables｀の方がかなり遅そう.

takaxp [21:09]
ありがとうございます．
benchmark-run との比較では，それぞれ差がなく，
setq vs. custom-set-variables の単純比較で100倍くらい差がありますね． （編集済み） 
Untitled 
#+BEGIN_SRC emacs-lisp
(defvar var1 nil)
(benchmark-run-compiled 10000 (setq var1 t))
#+END_SRC
#+RESULTS:
| 0.0014559999999999998 | 0 | 0.0 |
#+BEGIN_SRC emacs-lisp
(defvar var1 nil)
(benchmark-run 10000 (setq var1 t))
#+END_SRC
#+RESULTS:
| 0.001444 | 0 | 0.0 |
#+BEGIN_SRC emacs-lisp
(defvar var2 nil)
(benchmark-run 10000 (custom-set-variables
        '(var2 t)))
#+END_SRC
#+RESULTS:
| 0.163514 | 0 | 0.0 |
#+BEGIN_SRC emacs-lisp
(defvar var2 nil)
(benchmark-run-compiled 10000 (custom-set-variables
        '(var2 t)))
#+END_SRC
#+RESULTS:
| 0.297183 | 1 | 0.14077499999999965 |
折りたたむ 
custom-set-variables が色々やっているのがよくわかりました m(_ _)m

